madeonline/GreenhouseProject_continuation/Контроллер теплицы на STM32 с дисплеем NT35510/Main_STM32F407VGT6_Micro_01_20_06_25/Configuration_STM32_HARDWARE.h
#pragma once

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// USER SETTINGS
// ПОЛЬЗОВАТЕЛЬСКИЕ НАСТРОЙКИ
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

//--------------------------------------------------------------------------------------------------------------------------------
// директивы условной компиляции:
/*
    в общем случае для предварительной настройки прошивки достаточно закомментировать ту или иную директиву USE_*.
    конкретные настройки пинов и пр. - находятся после директив условной компиляции, и подхватываются только тогда,
    когда соответствующая директива USE_* определена.
 */
 //--------------------------------------------------------------------------------------------------------------------------------
// СПИСОК ЗАПРЕЩЁННЫХ ПИНОВ, КОТОРЫЕ НЕЛЬЗЯ БУДЕТ УКАЗАТЬ В КОНФИГУРАТОРЕ
//--------------------------------------------------------------------------------------------------------------------------------
// добавьте сюда пины, через запятую. Пины I2C, 0,1, SPI - уже помечены как небезопасные, и добавлять их сюда - не надо.
                        /* пины TFT-экрана, шина данных, 22-37         */
#define UNSAFE_PIN_LIST 4,11,12,13,14,15,18,19,20,22,23,26,26,27,28,29,30,31,37,38,39,40,41,42,43,44,46,47,48,49,50,52,53,55,56,57,58,61,62,63,71,72,73,74,75,76,77,78,79


//--------------------------------------------------------------------------------------------------------------------------------
// скорость работы I2C
//--------------------------------------------------------------------------------------------------------------------------------
#define MY_I2C_SPEED 100000UL // 400кГц, поменять на 100000UL для скорости 100кГц

//--------------------------------------------------------------------------------------------------------------------------------
// настройки SPI
//--------------------------------------------------------------------------------------------------------------------------------
// частота шины SPI, герц, для LoRa 
#define LORA_SPI_FREQUENCY        8000000ul 

// частота шины SPI, герц, для MCP23S17 
#define MCP_SPI_FREQUENCY        10000000ul 

//--------------------------------------------------------------------------------------------------------------------------------
// раскомментируйте эту настройку, если вам надо измерять температуру не в градусах Цельсия, а в Фаренгейтах
//#define MEASURE_TEMPERATURES_IN_FAHRENHEIT 
//--------------------------------------------------------------------------------------------------------------------------------
// закомментировать, если не хотим использовать модуль реального времени (DS3231)
// без этого модуля многий функционал не работает, например, логгирование информации или работа модуля полива по расписанию.
// можно считать, что использование этого модуля - обязательно.
#define USE_DS3231_REALTIME_CLOCK
#define DS3231_WIRE_NUMBER 0 // номер I2C для часов (0 - первый I2C, 1 - второй I2C). В STM32GENERIC НЕТ Wire1 !!!
#define USE_INTERNAL_CLOCK // раскомментировать, если надо использовать внутренние часы STM32 (если закомментировано - используются часы DS3231)
#define USE_INTERNAL_TEMP_SENSOR // закомментировать, если не надо использовать встроенный датчик температуры
//--------------------------------------------------------------------------------------------------------------------------------
// закомментировать, если не нужен модуль сценариев. Сценарии создаются при помощи программы SceneCreator.exe, и загружаются на SD-карту.
// Далее сценарии могут выполняться либо по клику на кнопке сценария на TFT-экране, либо при помощи внешних команд
// CTSET=SCN|EXEC|Number (запустить сценарий), CTSET=SCN|STOP|Number (остановить сценарий), где Number - номер сценария, начиная с 0.
#define USE_SCENE_MODULE
//--------------------------------------------------------------------------------------------------------------------------------
// закомментировать, если не нужен модуль управления пинами
// этот модуль косвенно используют другие модули (например, модуль составных команд) для управления пинами
#define USE_PIN_MODULE 
//--------------------------------------------------------------------------------------------------------------------------------
//#define USE_INFO_DIODES // использовать или нет информационные диоды (готовность, режимы работы окон, полива, досветки)
//--------------------------------------------------------------------------------------------------------------------------------
// раскомментировать, если надо управлять микросхемами MCP* с внешних команд (CTGET и CTSET, а также через MQTT командами GET и SET)
#define USE_MCP_MODULE

// SET:
//    CTSET=MCP|SPI|MODE|mcpNumber|mcpChannel|pinMode, for example  CTSET=MCP|SPI|MODE|0|7|OUT, CTSET=MCP|SPI|MODE|1|2|IN
//    CTSET=MCP|SPI|WRITE|mcpNumber|mcpChannel|level, for example  CTSET=MCP|SPI|WRITE|2|10|ON, CTSET=MCP|SPI|WRITE|0|4|OFF
//    CTSET=MCP|I2C|MODE|mcpNumber|mcpChannel|pinMode, for example  CTSET=MCP|I2C|MODE|0|7|OUT, CTSET=MCP|I2C|MODE|1|2|IN
//    CTSET=MCP|I2C|WRITE|mcpNumber|mcpChannel|level, for example  CTSET=MCP|I2C|WRITE|2|10|ON, CTSET=MCP|I2C|WRITE|0|4|OFF

// GET:
//    CTGET=MCP|SPI|mcpNumber|mcpChannel
//    CTGET=MCP|I2C|mcpNumber|mcpChannel
//--------------------------------------------------------------------------------------------------------------------------------
// закомментировать, если не нужна поддержка модуля статистики (FREERAM, UPTIME, DATETIME)
#define USE_STAT_MODULE
//--------------------------------------------------------------------------------------------------------------------------------
// закомментировать, если не нужна поддержка управления по SMS (SIM800)
//#define USE_SMS_MODULE 
//--------------------------------------------------------------------------------------------------------------------------------
// закомментировать, если не нужен модуль управления поливом (в принципе, тот же функционал можно реализовать через правила)
#define USE_WATERING_MODULE 
//--------------------------------------------------------------------------------------------------------------------------------
// закомментировать, если не нужен модуль контроля освещенности (BH17500 и MAX44009)
#define USE_LUMINOSITY_MODULE 
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_HUMIDITY_MODULE // закомментировать, если не нужен модуль работы с датчиками влажности DHT, Si7021, SHT
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_SOIL_MOISTURE_MODULE // закомментировать, если не нужен модуль датчиков влажности почвы
//--------------------------------------------------------------------------------------------------------------------------------
//#define USE_PH_MODULE // закомментировать, если не нужен модуль снятия показаний с датчиков pH и контроля за дозированием реагентов в систему
//--------------------------------------------------------------------------------------------------------------------------------
//#define USE_CO2_MODULE // закомментировать, если не нужен модуль снятия показаний с датчиков C02
//--------------------------------------------------------------------------------------------------------------------------------
//#define USE_LOG_MODULE // закомментировать, если не нужен модуль логгирования информации. Внимание: модуль работает только с модулем реального времени (USE_DS3231_REALTIME_CLOCK должна быть определена!)
//--------------------------------------------------------------------------------------------------------------------------------
//#define USE_DELTA_MODULE // закомментировать, если не нужно собирать показания дельт с датчиков (разница показаний между двумя датчиками)
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_WATERFLOW_MODULE // закомментировать, если не нужны датчик(и) расхода воды, настройки - см. ниже
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_COMPOSITE_COMMANDS_MODULE // закомментировать, если не нужен модуль составных команд (позволяет выполнить скопом несколько разных действий, используется правилами)
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_RESERVATION_MODULE // закомментировать, если не нужем модуль резервирования датчиков (когда при отсутствии показаний с одного датчика показания берутся со связанных с ним).
// модуль резервирования нужен для работы правил, если необходимо обеспечить работу правила даже тогда, когда один из датчиков вышел из строя
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_TIMER_MODULE // закомментировать, если не нужна поддержка модуля таймеров (4 таймера)
//--------------------------------------------------------------------------------------------------------------------------------
//#define USE_IOT_MODULE // закомментировать, если не нужна отсылка данных на IoT-хранилища (ThingSpeak). Настройки IoT смотрите ниже
//--------------------------------------------------------------------------------------------------------------------------------
//#define USE_ALARM_DISPATCHER // закомментировать, если не нужны тревоги (получение СМС при срабатывании правила)
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_EXTERNAL_WATCHDOG // закомментировать, если не нужен внешний контроль зависания меги (мега на определённой ноге дёргает уровни, если уровни не меняются - внешний ватчдог передёргивает питание)
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_WIFI_MODULE_AS_IOT_GATE // закомментировать, если не хотим использовать ESP как один из шлюзов для отсыла данных в IoT
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_WIFI_MODULE_AS_HTTP_PROVIDER // закомментировать, если не хотим посылать HTTP-запросы к сервису gardenboss.ru через ESP
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_WIFI_MODULE_AS_MQTT_CLIENT // раскомментировать, если хотим использовать ESP как MQTT-клиент
//--------------------------------------------------------------------------------------------------------------------------------
//#define MQTT_REPORT_AS_JSON // раскомментировать, если надо публиковать топик-ответ на выполнение команды в объекте JSON
//--------------------------------------------------------------------------------------------------------------------------------
//#define USE_GSM_MODULE_AS_IOT_GATE // закомментировать, если не хотим использовать GSM-модем как один из шлюзов для отсыла данных в IoT
//--------------------------------------------------------------------------------------------------------------------------------
//#define USE_GSM_MODULE_AS_HTTP_PROVIDER // закомментировать, если не хотим посылать HTTP-запросы к сервису gardenboss.ru через GSM
//--------------------------------------------------------------------------------------------------------------------------------
// закомментировать, если не нужно использовать никакие универсальные модули (если эта директива закомментирована - модули любых типов не используются),
// если раскомментирована - используются модули с датчиками на борту, исполнительные модули - используются в зависимости от настройки USE_UNI_EXECUTION_MODULE).
// если эта строка закомментирована - никакие из модулей использоваться не будут
#define USE_UNIVERSAL_MODULES
//--------------------------------------------------------------------------------------------------------------------------------
// раскомментировать, если нужна поддержка модуля с выносным дисплеем на шине RS-485 (прошивка UniversalRemoteDisplayModule)
// настройка работает только совместно с USE_RS485_GATE !!!
// настройка работает только совместно с настройкой USE_UNIVERSAL_MODULES !!!
//#define USE_REMOTE_DISPLAY_MODULE
//--------------------------------------------------------------------------------------------------------------------------------
// закомментировать, если не надо использовать выносной модуль на 7 кнопок с привязками к командам (прошивка UniversalControlModule)
// настройка работает только совместно с настройкой USE_UNIVERSAL_MODULES !!!
//#define USE_RS485_EXTERNAL_CONTROL_MODULE
//--------------------------------------------------------------------------------------------------------------------------------
 // закомментировать, если не нужна поддержка универсальных исполнительных модулей
// настройка работает только совместно с настройкой USE_UNIVERSAL_MODULES !!!
#define USE_UNI_EXECUTION_MODULE
//--------------------------------------------------------------------------------------------------------------------------------
// закомментировать, если не нужна проводная линия 1-Wire для регистрации универсальных модулей, а также линии 1-Wire для модулей
// настройка работает только совместно с настройкой USE_UNIVERSAL_MODULES !!!
#define USE_UNI_REGISTRATION_LINE
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_RS485_GATE // закомментировать, если не нужна поддержка опроса универсальных модулей по протоколу RS-485
//--------------------------------------------------------------------------------------------------------------------------------
//#define USE_NRF_GATE // закомментировать, если не нужно работать с универсальными модулями по радиоканалу nRF
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_LORA_GATE // закомментировать, если не нужно работать с универсальными модулями по радиоканалу LoRa (чипы SX1276/77/78/79)
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_HTTP_MODULE // закомментировать, если не нужна проверка на входящие команды и отсыл данных на сервис gardenboss.ru

//--------------------------------------------------------------------------------------------------------------------------------
// расширители портов
//--------------------------------------------------------------------------------------------------------------------------------
// использовать или нет расширители портов MCP23S17, при этом модули, которые поддерживают работу через эти расширители, могут работать через них. 
// Настройки расширителя на SPI смотрите ниже.
#define USE_MCP23S17_EXTENDER // раскомментировать, если хотите использовать MCP23S17 (работу через них поддерживает модуль полива и модуль досветки)

// использовать или нет расширители портов MCP23017, при этом модули, которые поддерживают работу через эти расширители, могут работать через них. 
// Настройки расширителя на I2C смотрите ниже.
//#define USE_MCP23017_EXTENDER // раскомментировать, если хотите использовать MCP23017 (работу через них поддерживает модуль полива и модуль досветки)


//--------------------------------------------------------------------------------------------------------------------------------
// настройки информационных диодов (актуальны при раскомментированной настройке USE_INFO_DIODES)
//--------------------------------------------------------------------------------------------------------------------------------

