madeonline/GreenhouseProject_continuation/Контроллер теплицы на STM32 с дисплеем NT35510/Main_STM32F407VGT6_Micro_01_20_06_25/Configuration_STM32_HARDWARE.h
//#define DISABLE_DIODES_CONFIGURE // если эта настройка РАСКОММЕНТИРОВАНА, то настройки диодов НЕДОСТУПНЫ через конфигуратор

// НАСТРОЙКИ диодов ПО УМОЛЧАНИЮ, ДЛЯ СЛУЧАЯ, КОГДА ДИРЕКТИВА DISABLE_DIODES_CONFIGURE - АКТИВНА

/* как работают диоды:
  linkUnbinded, // нет привязки
  linkDirect, // привязка напрямую к пинам
  linkMCP23S17, // привязка к MCP23S17
  linkMCP23017 // привязка к MCP23017
*/
#define DIODES_LINK_TYPE  linkUnbinded

#define DIODES_MCP_ADDRESS 1 // адрес MCP

#define DIODES_ON HIGH // уровень включения диодов

#define READY_DIODE_PIN 0 // пин (или номер канала MCP) диода готовности
#define BLINK_READY_DIODE 1 // мигать диодом готовности? (0 - нет, 1 - да)

#define WINDOWS_DIODE_PIN 1 // пин (или номер канала MCP) диода режима окон
#define WATERING_DIODE_PIN 2 // пин (или номер канала MCP) диода режима полива
#define LIGHT_DIODE_PIN 3 // пин (или номер канала MCP) диода режима досветки


//--------------------------------------------------------------------------------------------------------------------------------
// настройки RS-485 (актуальны при раскомментированной настройке USE_RS485_GATE)
//--------------------------------------------------------------------------------------------------------------------------------

#define DISABLE_RS485_CONFIGURE // если эта настройка РАСКОММЕНТИРОВАНА, то настройки RS-485 НЕДОСТУПНЫ через конфигуратор

// НАСТРОЙКИ RS-485 ПО УМОЛЧАНИЮ, ДЛЯ СЛУЧАЯ, КОГДА ДИРЕКТИВА DISABLE_RS485_CONFIGURE - АКТИВНА

#define RS485_SERIAL 3 // какой хардварный Serial будем использовать при работе с RS-485? 0 - не используется, 1 - Serial1 и т.д.

/* как работает пин управления приемом/передачей RS-485:
  linkUnbinded, // нет привязки
  linkDirect, // привязка напрямую к пинам
  linkMCP23S17, // привязка к MCP23S17
  linkMCP23017 // привязка к MCP23017
*/
#define RS485_LINK_TYPE  linkDirect

#define RS485_MCP_ADDRESS 0 // адрес MCP

#define RS485_DE_PIN PE1 // номер пина (или канала MCP) управления приемом/передачей

#define RS485_PUSH_FREQUENCY 1000ul // через сколько миллисекунд писать в шину RS-485 слепок состояния контроллера

#define RS485_ONE_SENSOR_UPDATE_INTERVAL 1234ul // // через сколько миллисекунд запрашивать с шины RS-485 показания одного датчика (полный цикл опроса будет равен интервалу*кол-во датчиков в системе)

#define RS485_BYTES_TIMEOUT 10 // кол-во байт, после неуспешной попытки вычитки которых принимать решение о таймауте (если данные по RS-485 не ходят - увеличьте это значение)

#define RS485_BAD_READINGS_RESET 5 // через сколько неудачных чтений с датчика сбрасывать его значения на вид "<нет данных>"

//--------------------------------------------------------------------------------------------------------------------------------
// Wi-Fi
//--------------------------------------------------------------------------------------------------------------------------------
// закомментировать, если не нужна поддержка управления через Wi-Fi (ESP8266)
// порт, на котором ESP слушает входящие команды в режиме точки доступа - 1975.
// ПРОШИВКА ДЛЯ ESP НАХОДИТСЯ В ПАПКЕ ESP_AT - РАБОТОСПОСОБНОСТЬ ПРОВЕРЕНА ТОЛЬКО В СВЯЗКЕ С ЭТОЙ ПРОШИВКОЙ!!!
// ИНСТРУКЦИИ ПО ПРОШИВКЕ НАХОДЯТСЯ В ТОЙ ЖЕ ПАПКЕ, В ФАЙЛЕ README.TXT!!!
// НАСТОЯТЕЛЬНО РЕКОМЕНДУЕТСЯ ИСПОЛЬЗОВАТЬ ПИН УПРАВЛЕНИЕ ПИТАНИЕМ ДЛЯ ПОЛНОГО ПЕРЕСБРОСА ESP!!!
#define USE_WIFI_MODULE

#define WIFI_PING_HOST        F("ya.ru") // хост для пингования на предмет обнаружения неполадок со связью
#define WIFI_PING_FREQUENCY   60000 // интервал пингования, миллисекунд
#define WIFI_BAD_PING_ATTEMPTS	5 // кол-во неуспешных попыток пинга, после которых ESP пересбрасывается по питанию


#define DISABLE_WIFI_CONFIGURE // если эта настройка РАСКОММЕНТИРОВАНА, то настройки WI-FI НЕДОСТУПНЫ через конфигуратор

// НАСТРОЙКИ WI-FI ПО УМОЛЧАНИЮ, ДЛЯ СЛУЧАЯ, КОГДА ДИРЕКТИВА DISABLE_WIFI_CONFIGURE - АКТИВНА

#define WIFI_SERIAL 2 // какой хардварный Serial будем использовать при работе с модемом? 0 - не используется, 1 - Serial1 и т.д.

/* как работает пин управления питанием WI-FI:
  linkUnbinded, // нет привязки
  linkDirect, // привязка напрямую к пинам
  linkMCP23S17, // привязка к MCP23S17
  linkMCP23017 // привязка к MCP23017
*/
#define WIFI_REBOOT_PIN_LINK_TYPE  linkDirect

// номер микросхемы MCP для пина управления питанием
#define WIFI_REBOOT_PIN_MCP_ADDRESS  0

// номер пина (или канала MCP) управления питанием
#define WIFI_REBOOT_PIN PB9

#define WIFI_POWER_ON LOW // уровень включения питания

//--------------------------------------------------------------------------------------------------------------------------------
// менеджер обратной связи для окон (универсальный модуль, который отдаёт информацию о положении окон и срабатывании концевиков)
//--------------------------------------------------------------------------------------------------------------------------------
//#define USE_FEEDBACK_MANAGER // закомментировать, если не нужно использовать модуль обратной связи по положению окон
// (прошивка UniversalExecutionModule с включенной обратной связью)
#define FEEDBACK_MANAGER_WAIT_TIME 15000 // если в течение указанного кол-ва миллисекунд после старта контроллера не придёт информация
// по положению окон - окна принудительно погонятся контроллером в закрытую позицию, чтобы обеспечить начальную точку отсчёта
#define FEEDBACK_MANAGER_UPDATE_INTERVAL 5000 // через сколько миллисекунд запрашивать информацию у модулей обратной связи
//--------------------------------------------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------------------------------------------
// настройки расширителей портов MCP23S17 (актуально при раскомментированной команде USE_MCP23S17_EXTENDER)
//--------------------------------------------------------------------------------------------------------------------------------
#define MCP23S17_CS_PIN 4 // номер пина chip select для микросхем MCP23S17
#define COUNT_OF_MCP23S17_EXTENDERS 1 // сколько расширителей портов MCP23S17 используется (0 - нисколько)
#define MCP23S17_ADDRESSES 1  // адреса расширителей MCP23S17, через запятую, кол-вом COUNT_OF_MCP23S17_EXTENDERS

//--------------------------------------------------------------------------------------------------------------------------------
// настройки расширителей портов MCP23017 (актуально при раскомментированной команде USE_MCP23017_EXTENDER)
//--------------------------------------------------------------------------------------------------------------------------------
#define COUNT_OF_MCP23017_EXTENDERS 0 // сколько расширителей портов MCP23017 используется (0 - нисколько)
// адреса расширителей MCP23017, через запятую, кол-вом COUNT_OF_MCP23017_EXTENDERS
// 0 - первый адрес 0x20, 1 - второй адрес 0x21 и т.п.
#define MCP23017_ADDRESSES 1,2,4,5

//--------------------------------------------------------------------------------------------------------------------------------
// НАСТРОЙКИ ВНЕШНЕГО ВАТЧДОГА (актуально при раскомментированной команде USE_EXTERNAL_WATCHDOG)
//--------------------------------------------------------------------------------------------------------------------------------
#define WATCHDOG_REBOOT_PIN PE2 //66 номер пина, на котором будут меняться уровни
#define WATCHDOG_NORMAL_LEVEL HIGH // уровень на ноге, который держится WATCHDOG_WORK_INTERVAL миллисекунд
#define WATCHDOG_TRIGGERED_LEVEL LOW // уровень импульса на ноге, который держится WATCHDOG_PULSE_DURATION миллисекунд
#define WATCHDOG_WORK_INTERVAL 1500 // через сколько миллисекунд на ноге будет уровень WATCHDOG_TRIGGERED_LEVEL
#define WATCHDOG_PULSE_DURATION 100 // сколько миллисекунд держать уровень WATCHDOG_TRIGGERED_LEVEL на ноге

//--------------------------------------------------------------------------------------------------------------------------------
// НАСТРОЙКИ УНИВЕРСАЛЬНЫХ МОДУЛЕЙ (актуально при раскомментированной команде USE_UNIVERSAL_MODULES)
//--------------------------------------------------------------------------------------------------------------------------------
#define UNI_MODULE_UPDATE_INTERVAL 2000 // через сколько мс обновлять показания с универсального модуля

//--------------------------------------------------------------------------------------------------------------------------------
// настройки nRF (актуально при раскомментированной команде USE_NRF_GATE)
//--------------------------------------------------------------------------------------------------------------------------------
#define NRF_CONTROLLER_STATE_CHECK_FREQUENCY 789 // через сколько миллисекунд проверять смену состояния контроллера (для отсылки в эфир при изменениях)
#define UNI_DEFAULT_RF_CHANNEL 19 // номер канала nRF по умолчанию

#define DISABLE_NRF_CONFIGURE // если эта настройка РАСКОММЕНТИРОВАНА, то настройки nRF НЕДОСТУПНЫ через конфигуратор

// НАСТРОЙКИ nRF ПО УМОЛЧАНИЮ, ДЛЯ СЛУЧАЯ, КОГДА ДИРЕКТИВА DISABLE_NRF_CONFIGURE - АКТИВНА


/* как работает пин управления питанием nRF:
  linkUnbinded, // нет привязки
  linkDirect, // привязка напрямую к пинам
  linkMCP23S17, // привязка к MCP23S17
  linkMCP23017 // привязка к MCP23017
*/
#define NRF_REBOOT_PIN_LINK_TYPE  linkUnbinded

#define NRF_REBOOT_PIN_MCP_ADDRESS 0 // номер MCP

#define NRF_REBOOT_PIN 0xFF // пин управления питанием (0xFF - не используется)

