madeonline/GreenhouseProject_continuation/Контроллер теплицы на STM32 с дисплеем NT35510/Main_STM32F407VGT6_Micro_01_20_06_25/Configuration_STM32_HARDWARE.h
#define NRF_POWER_ON HIGH // уровень включения питания

#define NRF_CE_PIN 0xFF // пин CE (0xFF - не используется)
#define NRF_CSN_PIN 0xFF // пин CSN (0xFF - не используется)
#define NRF_AUTOACK_INVERTED 0 // инвертированный auto ack? (0 - нет, 1 - да)


//--------------------------------------------------------------------------------------------------------------------------------
// настройки LoRa (актуально при раскомментированной команде USE_LORA_GATE)
//--------------------------------------------------------------------------------------------------------------------------------
#define LORA_CONTROLLER_STATE_CHECK_FREQUENCY 789 // через сколько миллисекунд проверять смену состояния контроллера (для отсылки в эфир при изменениях)

//#define DISABLE_LORA_CONFIGURE // если эта настройка РАСКОММЕНТИРОВАНА, то настройки LoRa НЕДОСТУПНЫ через конфигуратор

// НАСТРОЙКИ LoRa ПО УМОЛЧАНИЮ, ДЛЯ СЛУЧАЯ, КОГДА ДИРЕКТИВА DISABLE_LORA_CONFIGURE - АКТИВНА


/* как работает пин управления питанием LoRa:
  linkUnbinded, // нет привязки
  linkDirect, // привязка напрямую к пинам
  linkMCP23S17, // привязка к MCP23S17
  linkMCP23017 // привязка к MCP23017
*/
#define LORA_REBOOT_PIN_LINK_TYPE  linkUnbinded

#define LORA_REBOOT_PIN_MCP_ADDRESS 0 // номер MCP

#define LORA_REBOOT_PIN 0xFF // пин управления питанием (0xFF - не используется)

#define LORA_POWER_ON HIGH // уровень включения питания

#define LORA_SS_PIN 0xFF // пин SS (0xFF - не используется)
#define LORA_RESET_PIN 0xFF // пин RESET (0xFF - не используется)
#define LORA_TX_POWER 17 // мощность передатчика (1 - 17)
#define LORA_FREQUENCY 868 // частота работы (433, 868, 915)

//--------------------------------------------------------------------------------------------------------------------------------
// настройки EEPROM (МИНИМАЛЬНЫЙ ОБЪЁМ EEPROM - 16 Кб !!!)
//--------------------------------------------------------------------------------------------------------------------------------
/*
ПОДДЕРЖИВАЕМЫЕ ТИПЫ ПАМЯТИ:

  EEPROM_BUILTIN // встроенный EEPROM
  EEPROM_AT24C32 // I2C-память AT24C32 
  EEPROM_AT24C64 // I2C-память AT24C64 
  EEPROM_AT24C128 // I2C-память AT24C128 - МИНИМАЛЬНЫЙ НЕОБХОДИМЫЙ ОБЪЁМ !!! 
  EEPROM_AT24C256 // I2C-память AT24C256 
  EEPROM_AT24C512 // I2C-память AT24C512 
*/
#define EEPROM_USED_MEMORY EEPROM_AT24C128 // используем внешнюю память I2C AT24C128
// если используется внешнняя память AT24C* - то ниже определяется индекс микросхемы. Например, китайский модуль часов реального времени
// с DS3231 на борту имеет модуль памяти с адресом на шине I2C 0x57, т.е. индекс такого модуля - 7, т.к. базовый адрес памяти на шине - 
// 0x50. Настройкой ниже можно указать адрес микросхемы памяти на шине I2C.
#define EEPROM_MEMORY_INDEX 0

//--------------------------------------------------------------------------------------------------------------------------------
// настройки информационных диодов 
//--------------------------------------------------------------------------------------------------------------------------------
#define WORK_MODE_BLINK_INTERVAL 500 // с какой частотой мигать на пинах индикации ручного режима работы, мс
#define READY_DIODE_BLINK_INTERVAL 5000 // с какой частотой мигать диодом работы, мс

//--------------------------------------------------------------------------------------------------------------------------------
// настройки SD
//--------------------------------------------------------------------------------------------------------------------------------
//#define SDCARD_CS_PIN 52 // номер пина Chip Select для SD-модуля 


//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля правил
//--------------------------------------------------------------------------------------------------------------------------------
//#define ALERT_INCLUDE_COMMA_VALUES // раскомментировать, если в правилах надо сравнивать не только целую часть показаний, но и дробную

// закомментировать, если хотите, чтобы в режиме слежения за состоянием пина модуль правил читал прямо из него. При этом пин настраивается
// на вход. Если настройка активна - в режиме слежения за пином модуль правил читает из карты состояний пинов, не трогая пин контроллера.
// ВНИМАНИЕ: ПРИ РАБОТЕ С ПИНАМИ, НАСТРАИВАЕМЫМИ ТОЛЬКО НА ВХОД  - ДАННАЯ НАСТРОЙКА ДОЛЖНА
// БЫТЬ ЗАКОММЕНТИРОВАНА, Т.К. СОСТОЯНИЕ ТАКИХ ПИНОВ НЕ ПОПАДАЕТ В КАРТУ ПИНОВ !!!
//#define ALERT_DONT_READ_PIN_DIRECT

//--------------------------------------------------------------------------------------------------------------------------------
// настройки интервалов обновлений модулей
//--------------------------------------------------------------------------------------------------------------------------------
#define ALERT_UPDATE_INTERVAL 500 // интервал обновления состояния модуля ALERT, мс. Нужен, чтобы часто не разрешать зависимости - это ресурсоёмкая операция.
#define LOGGING_INTERVAL 300000 // интервал логгирования, мс (300000 - каждые 5 минут и т.п.)
#define LUMINOSITY_UPDATE_INTERVAL 3000 // через сколько мс обновлять показания с датчиков освещенности 
#define HUMIDITY_UPDATE_INTERVAL 5000 // через сколько мс обновлять показания с датчиков влажности
#define TEMP_UPDATE_INTERVAL 4990 // через сколько мс обновлять показания с датчиков температуры
#define DELTA_UPDATE_INTERVAL 5010 // через сколько миллисекунд обновлять показания дельт?


//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля CO2 (актуально при раскомментированной команде USE_CO2_MODULE)
//--------------------------------------------------------------------------------------------------------------------------------
#define CO2_UPDATE_INTERVAL 5000 // интервал обновления показаний с датчиков CO2 (можно менять через конфигуратор потом)
#define MAX_CO2_SENSOR_PPM 5000 // максимальное измеряемое датчиком значение PPM (можно менять через конфигуратор потом)
#define CO2_PPM_MIN_ADC_VALUE 200 // значение АЦП для минимального показания датчика (можно менять через конфигуратор потом)
#define CO2_PPM_MAX_ADC_VALUE 1000 // значение АЦП для максимального показания датчика (можно менять через конфигуратор потом)

