madeonline/GreenhouseProject_continuation/Контроллер теплицы на STM32 с дисплеем NT35510/Main_STM32F407VGT6_Micro_01_20_06_25/Configuration_STM32_HARDWARE.h
// периодичность смены уровня на пине сигнализации опасного уровня СО2, миллисекунд
#define CO2_ALERT_DURATION 500

// процент превышения CO2 от установленного, по превышению которого текущий уровень CO2 будет считаться опасным
// (например, если держим 100 ppm, гистерезис - 10 ppm, в этой настройке - 20, то по превышению 130 ppm включится сигнализация)
// (можно менять через конфигуратор потом)
#define CO2_ALERT_PERCENTS 30

//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля контроля pH (РАБОТАЕТ ЧЕРЕЗ МИКРОСХЕМУ PCF8574T на шине I2C, или через MCP23*17) (актуально при раскомментированной команде USE_PH_MODULE)
//--------------------------------------------------------------------------------------------------------------------------------
/*
 Принцип работы модуля контроля pH:
 
   1. Все каналы заведены через микросхему MCP23*17 (или напрямую);
      
   2. К одному из каналов подключен датчик понижения уровня жидкости в ёмкости с рабочим раствором, 
      который при срабатывании выдаёт сигнал определённого уровня;
      
   3. При срабатывании датчика уровня начинается пополнение ёмкости с рабочим раствором, для этого на канал, 
      к которому подключен клапан подачи воды - подаётся определённый уровень;
      
   4. Как только ёмкость заполнена - начинается контроль pH;
   
   5. При отклонении pH от нужных значений, в зависимости от направления отклонения - 
      на каналы клапанов для повышения/понижения значения pH подаётся нужный уровень;
      
   6. После подачи корректировочного раствора в нужном объёме на канал управление насосом, 
      перемешивающим рабочий раствор, подаётся нужный уровень;
      
   7. После окончания перемешивания система продолжает контролировать pH, периодически при необходимости 
      повторяя вышеописанные действия, чтобы добиться требуемого уровня pH.
   
 */
//--------------------------------------------------------------------------------------------------------------------------------

#define PH_MV_PER_7_PH 2000 // кол-во милливольт, при  которых датчик показывает 7 pH
#define PH_FLOW_LEVEL_TRIGGERED HIGH // уровень, при котором датчик уровня воды считается сработавшим
#define PH_OUTPUTS_LEVEL_TRIGGERED LOW // уровень включения выходов

#define PH_SAMPLES_PER_MEASURE 10 // сколько делать замеров на одно измерение pH (1-255)
#define PH_SAMPLES_INTERVAL 20 // сколько миллисекунд между замерами в одном цикле измерения делать (10 - 255)
#define PH_UPDATE_INTERVAL 15678 // через сколько миллисекунд обновлять показания с датчика pH, прикреплённого к меге
#define PH_DEFAULT_CALIBRATION 0 // поправочное число по умолчанию, в сотых долях (т.е. 1 - это 0,01 сотая, 10 - это 0,1 и т.п.)
#define PH_DEFAULT_TARGET 700 // желаемое значение pH раствора на выходе, по умолчанию, целое число (700 = 7.00, 651 = 6.51 и т.п.)

// значение гистерезиса по умолчанию, в сотых долях (50 = 0.5, 100 = 1.0, 123 = 1.23 и т.п.). 
// Если pH раствора находится в рамках гистерезиса - корректировки pH не происходит.
#define PH_DEFAULT_HISTERESIS 50 // гистерезис

#define PH_DEFAULT_MIX_PUMP_TIME 60 // время работы насоса перемешивания по умолчанию, после каждой корректировки pH, секунд
#define PH_DEFAULT_REAGENT_PUMP_TIME 2 // время работы подачи реагента по умолчанию, для изменения pH на 0.1, секунд

#define PH_CONTROL_CHECK_INTERVAL 10000 // через сколько миллисекунд контролировать значение pH на предмет попадания в эталонный диапазон



//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля датчиков влажности почвы (актуально при раскомментированной команде USE_SOIL_MOISTURE_MODULE)
//--------------------------------------------------------------------------------------------------------------------------------
#define SOIL_MOISTURE_UPDATE_INTERVAL 10000 // через сколько мс обновлять показания с датчиков влажности почвы

//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля температур/управления фрамугами
//--------------------------------------------------------------------------------------------------------------------------------
#define DEF_OPEN_INTERVAL 3000 // по умолчанию 3 секунды работы мотора на полное открытие/закрытие фрамуги
#define DEF_OPEN_TEMP 25 // температура открытия по умолчанию, градусов Цельсия
#define DEF_CLOSE_TEMP 24 // температура закрытия по умолчанию, градусов Цельсия
#define WINDOW_POSITION_HISTERESIS 100 // кол-во миллисекунд работы моторов, которое следует игнорировать, если текущая позиция окон
// находится в рамках этого гистерезиса, т.е. разница текущей позиции и запрошенной - меньше гистерезиса

// На каждом пине окна висит одно реле, пара реле (например,
// 40 и 41) образуют одну пару управления DC-мотором. 
// Как подключается мотор: контакты двигателя подключаются к общим (COM) контактам пары реле.
// Плюс питания - к NO (нормально разомкнутым контактам пары реле).
// Минус питания - к NC (нормально замкнутым контактам реле).


//--------------------------------------------------------------------------------------------------------------------------------
// настройки концевиков для окон. Для каждого окна - два концевика, на открытие и закрытие.
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_WINDOWS_ENDSTOPS // закомментировать, если не нужно использовать концевики для окон


//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля управления поливом (актуально при раскомментированной команде USE_WATERING_MODULE)
//--------------------------------------------------------------------------------------------------------------------------------

// закомментировать, если не надо использовать защиту полива (уровни на определённых пинах, при которых полив включаться не будет).
// защиту полива можно использовать, например, для предотвращения включения насоса тогда, когда в системе нет воды,
// или тогда, когда температура воды ниже определённого уровня
 //#define USE_WATERING_GUARD

 // уровень на пине, при котором тревога полива считается сработавшей
 #define WATERING_GUARD_ALERT HIGH
 
