madeonline/GreenhouseProject_continuation/Контроллер теплицы на STM32 с дисплеем NT35510/Main_STM32F407VGT6_Micro_01_20_06_25/Configuration_STM32_HARDWARE.h
 // определения пинов, с которых будет читаться уровень. Если уровень хотя бы на одном из пинов равен уровню WATERING_GUARD_ALERT - 
 // то полив и насосы сразу выключатся. Пины могут быть как реальными, так и виртуальными (с номерами от 80 до 127),
 // что даёт возможность управлять уровнем виртуальных пинов через правила - например, можно создать правило, которое выставит нужный уровень
 // на виртуальном пине тогда, когда температура на датчике ниже пороговой, а также создать правило, которое будет сбрасывать уровень на пине
 // на противоположный, когда температура воды для полива - приемлема.
 // пины перечисляются через запятую!
 #define WATERING_GUARD_PINS 80, 81, 82
 
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// Настройки пищалки
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// раскомментировать, если надо использовать пищалку для звуков при нажатии кнопок TFT-экрана
#define USE_BUZZER 

#define DISABLE_BUZZER_CONFIGURE // если эта настройка РАСКОММЕНТИРОВАНА, то настройки пищалки НЕДОСТУПНЫ через конфигуратор

// НАСТРОЙКИ ПИЩАЛКИ ПО УМОЛЧАНИЮ, ДЛЯ СЛУЧАЯ, КОГДА ДИРЕКТИВА DISABLE_BUZZER_CONFIGURE - АКТИВНА

/* как работает пищалка:
  linkUnbinded, // нет привязки
  linkDirect, // привязка напрямую к пинам
  linkMCP23S17, // привязка к MCP23S17
  linkMCP23017 // привязка к MCP23017
*/
#define BUZZER_LINK_TYPE  linkDirect

// номер микросхемы MCP
#define BUZZER_MCP_ADDRESS 0

// уровень включения пищалки
#define BUZZER_LEVEL HIGH

// пин пищалки
#define BUZZER_PIN PD11

// длительность писка, миллисекунд
#define BUZZER_DURATION 60


//------------------------------------------------------------------------------------------------------------------------------------------------------------------------
// настройки TFT
//------------------------------------------------------------------------------------------------------------------------------------------------------------------------

// Тач-скрин сидит на SPI2 !!!

#define  TOUCH_IRQ_Pin       GPIO_PIN_5   //  Определяем вывод информирующий о нажатии на тачскрин
#define  TOUCH_IRQ_GPIO_Port GPIOC        //  Определяем порт  TOUCH_IRQ_Pin
#define  TOUCH_PRESCALER     SPI_BAUDRATEPRESCALER_256 // прескалер для тача


// настройки для дисплея 4 дюйма, 480х800, драйвер дисплея NT35510
#define INCH_4_TFT_SCREEN_WIDTH 800  // ширина дисплея, в пикселях
#define INCH_4_TFT_SCREEN_HEIGHT 480 // высота дисплея, в пикселях

// настройки тачскрина 4''
#define INCH_4_TOUCH_CS  PB12    // Pin выбора микросхемы тачскрина
#define INCH_4_TOUCH_IRQ PC5   // Pin определения нажатия тачскрина

#define  INCH_4_TOUCH_SCALE_X INCH_4_TFT_SCREEN_WIDTH               // Размер  тача по горизонтали X (по умолчанию совпадает с шириной дисплея)
#define  INCH_4_TOUCH_SCALE_Y INCH_4_TFT_SCREEN_HEIGHT              // Размер тача по вертикали  Y (по умолчанию совпадает с высотой дисплея)

#define  INCH_4_TOUCH_MIN_RAW_X 260     // Реальная минимальная величина по оси X (подстроить под конкретный дисплей)
#define  INCH_4_TOUCH_MAX_RAW_X 3750    // Реальная максимальная величина по оси X(подстроить под конкретный дисплей)

#define  INCH_4_TOUCH_MIN_RAW_Y 245     // Реальная минимальная величина по оси Y (подстроить под конкретный дисплей)
#define  INCH_4_TOUCH_MAX_RAW_Y 3850    // Реальная максимальная величина по оси Y(подстроить под конкретный дисплей)

#define INCH4_TOUCH_ROTATION 4 // какой поворот делать для тача дисплея 4 дюйма (0-4)?
#define INCH4_ROTATION 3 // поворот дисплея 4 дюйма


// настройки для дисплея 7 дюймов, 480х800, драйвер дисплея SSD1963
#define INCH_7_TFT_SCREEN_WIDTH 800  // ширина дисплея, в пикселях
#define INCH_7_TFT_SCREEN_HEIGHT 480 // высота дисплея, в пикселях

// настройки тачскрина 7''
#define INCH_7_TOUCH_CS  PB12    // Pin выбора микросхемы тачскрина
#define INCH_7_TOUCH_IRQ PC5   // Pin определения нажатия тачскрина

#define  INCH_7_TOUCH_SCALE_X INCH_7_TFT_SCREEN_WIDTH               // Размер  тача по горизонтали X (по умолчанию совпадает с шириной дисплея)
#define  INCH_7_TOUCH_SCALE_Y INCH_7_TFT_SCREEN_HEIGHT              // Размер тача по вертикали  Y (по умолчанию совпадает с высотой дисплея)

#define  INCH_7_TOUCH_MIN_RAW_X 215     // Реальная минимальная величина по оси X (подстроить под конкретный дисплей)
#define  INCH_7_TOUCH_MAX_RAW_X 3900    // Реальная максимальная величина по оси X(подстроить под конкретный дисплей)

#define  INCH_7_TOUCH_MIN_RAW_Y 460     // Реальная минимальная величина по оси Y (подстроить под конкретный дисплей)
#define  INCH_7_TOUCH_MAX_RAW_Y 3800    // Реальная максимальная величина по оси Y(подстроить под конкретный дисплей)

#define INCH7_TOUCH_ROTATION 1 // какой поворот делать для тача дисплея 7 дюймов (0-4)?
#define INCH7_ROTATION 3 // поворот дисплея 7 дюймов
    

#define DISABLE_TFT_CONFIGURE // если эта настройка РАСКОММЕНТИРОВАНА, то настройки TFT НЕДОСТУПНЫ через конфигуратор

// НАСТРОЙКИ TFT ПО УМОЛЧАНИЮ, ДЛЯ СЛУЧАЯ, КОГДА ДИРЕКТИВА DISABLE_TFT_CONFIGURE - АКТИВНА


/* как работает пин управления подсветкой TFT:
  linkUnbinded, // нет привязки
  linkDirect, // привязка напрямую к пинам
  linkMCP23S17, // привязка к MCP23S17
  linkMCP23017 // привязка к MCP23017
*/
#define TFT_BACKLIGHT_LINK_TYPE  linkDirect

#define TFT_BACKLIGHT_MCP_ADDRESS 4 // номер MCP

#define TFT_BACKLIGHT_PIN PB1 // номер пина (или канала MCP) управления подсветкой TFT

#define TFT_BACKLIGHT_ON LOW // уровень включения подсветки

#define TFT_INIT_DELAY 100 // сколько миллисекунд (при необходимости) ждать перед отсылкой первых команд на дисплей

#define TFT_OFF_DELAY 360000ul // время выключения подсветки экрана при бездействии, миллисекунд

#define TFT_DISPLAY_TYPE 2 // тип дисплея (0 - не используется, 1 - 7 дюймов, 2 - 4 дюйма)  
  

//--------------------------------------------------------------------------------------------------------------------------------
// настройки TFT, общие для всех дисплеев
//--------------------------------------------------------------------------------------------------------------------------------

// разделитель целой и дробной части показаний, по умолчанию - запятая (charComma). Используйте charDot для точки.
#define TFT_SENSOR_DECIMAL_SEPARATOR charComma 


// через сколько миллисекунд перечитывать показания с датчиков
#define TFT_SENSORS_UPDATE_INTERVAL 5000 


//--------------------------------------------------------------------------------------------------------------------------------
// Настройки для модуля с выносным дисплеем (актуально при раскомментированной команде USE_REMOTE_DISPLAY_MODULE)
//--------------------------------------------------------------------------------------------------------------------------------
// интервал обновления показаний датчиков на экране ожидания выносного дисплея, мс
#define REMOTE_DISPLAY_UPDATE_INTERVAL 15000

// настройки датчиков для выносного дисплея.
// записываются в фигурных скобках, через запятую. Внутри фигурных скобок через запятую указывается - тип показаний, индекс датчика, имя модуля.
// данные передаются на выносной дисплей в том порядке, в котором их прописали.
#define REMOTE_DISPLAY_SENSORS { StateTemperature,0,"STATE" }, { StateHumidity,1,"HUMIDITY" }, { StateLuminosity,0,"LIGHT" }


//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля учёта воды (актуально при раскомментированной команде USE_WATERFLOW_MODULE)
//--------------------------------------------------------------------------------------------------------------------------------
// поддерживаемые типы датчиков - китайские water flow meter с датчиком Холла.

// сколько пульсаций в секунду выдаёт датчик при протекании литра за минуту - 
// калибровочное значение, если не совпадает с реальным расходом - подбирать!
#define WATERFLOW_CALIBRATION_FACTOR 45 // фактор калибровки по умолчанию, можно потом менять через конфигуратор

#define WATERFLOW_CHECK_FREQUENCY 2000 // через сколько мс обновлять показания с датчиков расхода

//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля управления по SMS (модем  SIM800) (актуально при раскомментированной команде USE_SMS_MODULE)
//--------------------------------------------------------------------------------------------------------------------------------
#define GSM_PING_HOST F("ya.ru") // хост, который пингуем

#define WORK_STARTED_SMS_TEXT F("Контроллер начал работу.") // текст СМС, который будет посылаться при старте контроллера в работу

// настройки датчиков для СМС статистики по умолчанию (если нет SD-карты или там ничего не сохранено)
// индексы модулей:
// 1 - модуль температур
// 2 - модуль влажности
// 3 - модуль освещённости
// 4 - модуль влажности почвы

#define STATUS_SMS_DEFAULT_MODULE1 1 // модуль для первого датчика
#define STATUS_SMS_DEFAULT_SENSOR1 0 // индекс датчика в первом модуле
#define STATUS_SMS_DEFAULT_LABEL1 F("Твнутр") // подпись по умолчанию для первого датчика

