madeonline/GreenhouseProject_continuation/Контроллер теплицы на STM32 с дисплеем NT35510/Main_STM32F407VGT6_Micro_01_20_06_25/Configuration_STM32_HARDWARE.h
#define STATUS_SMS_DEFAULT_MODULE2 1 // модуль для второго датчика
#define STATUS_SMS_DEFAULT_SENSOR2 1 // индекс датчика во втором модуле
#define STATUS_SMS_DEFAULT_LABEL2 F("Тнаруж") // подпись по умолчанию для второго датчика


#define DISABLE_GSM_CONFIGURE // если эта настройка РАСКОММЕНТИРОВАНА, то настройки GSM НЕДОСТУПНЫ через конфигуратор

// НАСТРОЙКИ GSM ПО УМОЛЧАНИЮ, ДЛЯ СЛУЧАЯ, КОГДА ДИРЕКТИВА DISABLE_GSM_CONFIGURE - АКТИВНА

#define GSM_SERIAL 6 // какой хардварный Serial будем использовать при работе с модемом? 0 - не используется, 1 - Serial1 и т.д.

/* как работает пин управления питанием GSM:
  linkUnbinded, // нет привязки
  linkDirect, // привязка напрямую к пинам
  linkMCP23S17, // привязка к MCP23S17
  linkMCP23017 // привязка к MCP23017
*/
#define GSM_REBOOT_PIN_LINK_TYPE  linkDirect

#define GSM_REBOOT_PIN_MCP_ADDRESS 0 // адрес MCP

#define GSM_REBOOT_PIN PD3 // номер пина (или канала MCP) управления питанием

#define GSM_POWER_ON HIGH // уровень включения питания

#define GSM_PULL_GPRS 1 // пинговать GPRS-соединение? (0 - нет, 1 - да)

/* как работает пин управления POWERKEY:
  linkUnbinded, // нет привязки
  linkDirect, // привязка напрямую к пинам
  linkMCP23S17, // привязка к MCP23S17
  linkMCP23017 // привязка к MCP23017
*/
#define GSM_POWERKEY_LINK_TYPE linkDirect

#define GSM_POWERKEY_MCP_ADDRESS 0 // номер MCP для управления POWERKEY

#define GSM_POWERKEY_PIN PE0 // номер пина (или канала MCP) для управления POWERKEY

#define GSM_POWERKEY_PULSE_DURATION 300ul // длительность импульса POWERKEY, миллисекунд

#define GSM_POWERKEY_ON_LEVEL LOW // уровень включения POWERKEY

//--------------------------------------------------------------------------------------------------------------------------------
// настройки тревог (актуально при раскомментированной команде USE_ALARM_DISPATCHER)
//--------------------------------------------------------------------------------------------------------------------------------
#define ALARM_SMS_TEXT F("Тревога! Сработало правило: ") // текст СМС, который отправится при срабатывании тревожного правила, к СМС будет добавлено имя правила
//#define CLEAR_ALARM_STATUS // раскомментировать, если надо очищать сработавшие тревоги через указанный ниже промежуток времени. 
//Если тревоги не очищаются - SMS посылается однократно, до перезагрузки контроллера
#define ALARM_CLEAR_INTERVAL 10 // интервал между очистками сработавших тревог, в минутах

//--------------------------------------------------------------------------------------------------------------------------------
// синхронизация времени
//--------------------------------------------------------------------------------------------------------------------------------
#define GSM_SYNC_TIME_INTERVAL 12 // время между синхронизацией часов, в часах
#define GPRS_RECONNECT_TIME 35000 // интервал между попытками реконнекта по GPRS, мс

#define NTP_SERVER F("pool.ntp.org") // адрес NTP-сервера
#define NTP_PORT 123 // порт NTP-сервера
#define NTP_TIMEZONE 180 // смещение таймзоны (в минутах) от GMT (нулевого меридиана)
#define NTP_UPDATE_INTERVAL 12 // время между синхронизацией часов, в часах
//#define YEAR_30_FIX // раскомментировать, если надо сдвигать дату на 30 лет назад (фикс неправильного расчёта времени, когда дата оказывается сдвинутой на 30 лет вперёд)

//--------------------------------------------------------------------------------------------------------------------------------
// МОДУЛЬ ДИНАМИЧЕСКОГО СБРОСА ИНФОРМАЦИИ С WI-FI-модулей с датчиками
//--------------------------------------------------------------------------------------------------------------------------------
//#define USE_DYNAMIC_SENSORS_RESET_MODULE // использовать или нет модуль для динамического сброса информации с датчиков Wi-Fi модулей.
// данный модуль в прошивке контроллера делает следующее: если данные по датчику пришли в контроллер извне - он запоминает время получения
// данных для такого датчика. И если для датчика не будет поступать данных в течение указанного ниже интервала - то данные автоматически 
// сбросятся на показания "нет данных"

#define DYNAMIC_SENSORS_RESET_INTERVAL 60000 // через сколько миллисекунд сбрасывать данные для динамически добавленных в систему датчиков

//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля измерения давления
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_PRESSURE_MODULE // закомментировать, если не надо использовать модуль давления
#define DRAW_PRESSURE_ON_SCREEN // закомментировать, если не нужно отображать давление на TFT-экране
#define PRESSURE_UPDATE_INTERVAL 10000 // интервал обновления показаний давления, миллисекунд
#define PRESSURE_SEALEVEL 114 // высота над уровнем моря точки измерения, по умолчанию

//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля автоматического управления фрамугами
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_WINDOW_MANAGE_MODULE // закомментировать, если не надо использовать модуль автоматического управления фрамугами 
// отображения информации датчиков дождя и ветра на TFT-экране. Если эта настройка закомментирована, то вне зависимости от
// настроек USE_WIND_SENSOR и USE_RAIN_SENSOR - показания датчиков ветра и дождя отображаться на экране не будут.

#define WINDOW_DECISION_UPDATE_INTERVAL 5000 // интервал между принятиями решений по контролю фрамуг, мс

// через сколько мс обновлять данные по дождю и ветру
// ДАННЫЙ ИНТЕРВАЛ ДОЛЖЕН БЫТЬ БОЛЬШЕ, ЧЕМ ИНТЕРВАЛ ПРИНЯТИЯ РЕШЕНИЙ ПО ОКНАМ ( см. WINDOW_DECISION_UPDATE_INTERVAL)
#define WIND_RAIN_UPDATE_INTERVAL 11023 

//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля солнечной установки - ЭКСПЕРИМЕНТАЛЬНО, НЕ ТРОГАТЬ ЭТИ НАСТРОЙКИ !!!
//--------------------------------------------------------------------------------------------------------------------------------
// использовать или нет связь с контроллером солнечной установки (прошивка UniversalSunControllerModule)
//#define USE_UNI_SUN_CONTROLLER_MODULE
#define UNI_SUN_CONTROLLER_UPDATE_INTERVAL 4500 // через сколько миллисекунд запрашивать по RS-485 данные с контроллера солнечной установки


//--------------------------------------------------------------------------------------------------------------------------------
// настройки датчика ветра
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_WIND_SENSOR // закомментировать, если не надо использовать работу с датчиком ветра
#define WIND_SENSOR_UPDATE_INTERVAL 5000 // через сколько миллисекунд пересчитывать скорость ветра
#define WIND_SENSOR_INT_LEVEL FALLING // уровень для прерывания

//--------------------------------------------------------------------------------------------------------------------------------
// настройки датчика дождя
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_RAIN_SENSOR // закомментировать, если не нужно использовать работу с датчиком дождя

//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля управления отоплением
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_HEAT_MODULE // закомментировать, если не надо использовать модуль управления контурами отопления

#define HEAT_DECISION_UPDATE_INTERVAL 10000 // интервал между принятиями решений по контролю отопления, мс
#define HEAT_STATUS_UPDATE_INTERVAL 5000 // интервал обновления статуса контуров отопления на стартовом экране

#define HEAT_MAX_ALLOWED_TEMP 120 // максимальное значение температуры контура при редактировании
#define HEAT_MAX_WORK_TIME 180 // максимальное время работы приводов, с, для редактирования

