madeonline/GreenhouseProject_continuation/Контроллер теплицы на STM32 с дисплеем NT35510/Main_STM32F407VGT6_Micro_01_20_06_25/Configuration_STM32_HARDWARE.h
//расчет мощности для отопления по ПИ закону регулирования

#define HEAT_kP                   6     // коэффициент пропорциональности
#define HEAT_P_MIN                0.0   // минимум П составляющей - не < 0
#define HEAT_P_MAX                100.0 // максимум П составляющей - не > 100 
#define HEAT_kI                   0.025 // коэффициент интегрирования
#define HEAT_I_MIN                0.0   // минимум И составляющей
#define HEAT_I_MAX                30.0  // максимум И составляющей
#define HEAT_K_PROP               4.0   //зона пропорциональности "уставка - HEAT_K_PROP"


//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля затенения
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_SHADOW_MODULE // закомментировать, если не надо использовать модуль затенения

#define SHADOW_MAX_WORK_TIME 180 // максимальное время работы приводов, с, для редактирования
#define SHADOW_DECISION_UPDATE_INTERVAL 10000 // интервал между принятиями решений по контролю затенения, мс

//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля управления досветкой
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_LIGHT_MANAGE_MODULE // закомментировать, если не надо использовать модуль управления досветкой

#define LIGHT_DECISION_UPDATE_INTERVAL 10000 // интервал между принятиями решений по контролю за освещённостью, мс

//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля циркуляционной вентиляции
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_CYCLE_VENT_MODULE // закомментировать, если не нужно использовать модуль циркуляционной вентиляции (3 канала)

//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля вентиляции по температуре
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_VENT_MODULE // закомментировать, если не надо использовать модуль вентиляции по температуре (3 канала)

#define VENT_UPDATE_INTERVAL 3000 // через сколько миллисекунд опрашиваем датчик температуры


//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля термостата
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_THERMOSTAT_MODULE // закомментировать, если не надо использовать модуль термостатов (3 канала)

#define THERMOSTAT_UPDATE_INTERVAL 3000 // через сколько миллисекунд опрашиваем датчик температуры


//--------------------------------------------------------------------------------------------------------------------------------
// настройки модуля управления входными дверями
//--------------------------------------------------------------------------------------------------------------------------------
#define USE_DOOR_MODULE // закомментировать, если не надо использовать модуль управления входными дверями

//--------------------------------------------------------------------------------------------------------------------------------
// настройки броадкаста состояния контроллера по Wi-Fi
//--------------------------------------------------------------------------------------------------------------------------------
#define ENABLE_CONTROLLER_STATE_BROADCAST // закомментировать, если не надо отсылать состояние контроллера по Wi-Fi широковещательным пакетом
#define CONTROLLER_STATE_BROADCAST_DURATION 2000ul // через сколько миллисекунд отсылать состояние контроллера широковещательным пакетом (если состояние изменилось)
